app/Controllers/b2b/Leads.php

    public function getAvailDates() {
        $user = session()->get('oauth_uid');


        $leads = $this->fileModel
                ->select('DATE(files.created_at) as avail_date')
                ->join('lead_lists', 'lead_lists.file_id = files.id')
                ->where('files.oauth_uid', $user)
                ->groupBy('DATE(files.created_at)')
                ->orderBy('files.created_at', 'DESC')->get();
---
SELECT DATE(files.created_at) as avail_date
FROM `files`
JOIN `lead_lists` ON `lead_lists`.`file_id` = `files`.`id`
WHERE `files`.`oauth_uid` = '33'
GROUP BY DATE(files.created_at)
ORDER BY `files`.`created_at` DESC