app/Controllers/pnp/Home.php

SELECT *
FROM `files`
ORDER BY `created_at` DESC
---
            $target = session()->get('user_ext');
        }

        $historyUpload = $this->fileModel->orderBy('created_at', 'DESC')->get();

SELECT *
FROM `staffs`
SELECT *
FROM `buyers`
WHERE `user_id` = '26'
---

        $purchases = $this->orderModel->getPurchaseData(date('Y-m-d'));

        $staffs = $this->staffModel->get();
        $buyers = $this->buyerStaffModel->where('user_id', session()->get('user_id'))->get();

SELECT *
FROM `buyers`
JOIN `buyer_details` ON `buyer_details`.`buyer` = `buyers`.`id`
---
    public function masterLists() {

        $userRole = session()->get('user_id');
        if (empty($userRole)) {
            header("Location: ".base_url('/pnp/login'));
            die();
        }
        $purchases = $this->assignModel->getAssignedData2();
        $buyers = $this->buyerStaffModel
            ->join('buyer_details', 'buyer_details.buyer = buyers.id')
            ->get();

SELECT *
FROM `clients`
SELECT *
FROM `clients`
WHERE `check_flag` = 'checked'
---

        $response = "";

        $clientIDs = $this->clientModel->get();
        $clientList = $this->clientModel
            ->where('check_flag', 'checked')
            ->get();

SELECT *
FROM `clients`
SELECT *
FROM `clients`
WHERE `check_flag` = 'checked'
---
        $uid = session()->get('user_id');
        $clients = $this->clientModel->getClients($uid);

        $clientIDs = $this->clientModel->get();
        $clientList = $this->clientModel
            ->where('check_flag', 'checked')
            ->get();

SELECT *
FROM `buyers`
JOIN `buyer_details` ON `buyer_details`.`buyer` = `buyers`.`id`
---
    public function inventories() {
        $userRole = session()->get('user_id');
        if (empty($userRole)) {
            header("Location: ".base_url('/pnp/login'));
            die();
        }

        $purchases = $this->assignModel->getAssignedData2();
        $buyers = $this->buyerStaffModel
            ->join('buyer_details', 'buyer_details.buyer = buyers.id')
            ->get();

SELECT *
FROM `clients`
SELECT *
FROM `clients`
WHERE `check_flag` = 'checked'
---

            array_push($lists, $item);
        }
        $clientIDs = $this->clientModel->get();
        $clientList = $this->clientModel
            ->where('check_flag', 'checked')
            ->get();

SELECT *
FROM `buyers`
JOIN `buyer_details` ON `buyer_details`.`buyer` = `buyers`.`id`
---
            'total_received_uncomleted' => $totalReceivedCompleted->total,
            'total_unassigned' => $totalUnassigned->total,
        ];
        $buyers = $this->buyerStaffModel
            ->join('buyer_details', 'buyer_details.buyer = buyers.id')
            ->get();


        $purchases = $this->assignModel->getAssignedData2();
        $buyers = $this->buyerStaffModel
            ->join('buyer_details', 'buyer_details.buyer = buyers.id')
            ->get();