app/Controllers/pnp/Home.php

        $uid = session()->get('user_id');
        $clients = $this->clientModel->getClients($uid);

        $clientIDs = $this->clientModel->get();
        $clientList = $this->clientModel
            ->where('check_flag', 'checked')
            ->get();
---
SELECT *
FROM `clients`
SELECT *
FROM `clients`
WHERE `check_flag` = 'checked'

        $assignedData = $this->assignModel->getAssignedData3($start, $end);
        $getBoxes = $this->boxModel->getBoxes($start, $end);

        $buyers = $this->buyerStaffModel
            ->join('buyer_details', 'buyer_details.buyer = buyers.id')
            ->get();
---
SELECT *
FROM `buyers`
JOIN `buyer_details` ON `buyer_details`.`buyer` = `buyers`.`id`

            'total_received_uncomleted' => $totalReceivedCompleted->total,
            'total_unassigned' => $totalUnassigned->total,
        ];
        $buyers = $this->buyerStaffModel
            ->join('buyer_details', 'buyer_details.buyer = buyers.id')
            ->get();


        $purchases = $this->assignModel->getAssignedData2();
        $buyers = $this->buyerStaffModel
            ->join('buyer_details', 'buyer_details.buyer = buyers.id')
            ->get();
---
SELECT *
FROM `buyers`
JOIN `buyer_details` ON `buyer_details`.`buyer` = `buyers`.`id`