app/Controllers/pnp/Messages.php

        public function sendMessage() {
            $chat = $this->request->getVar('message');
            $id = $this->request->getVar('id');
            $date = date('Y-m-d H:i:s');
            if (is_null($id)) {
                $this->messageModel->save([
                    'author' => session()->get('user_id'),
                    'message' => $chat,
                    'receiver' => 25,
                    'created_at' => $date
                ]);
---
INSERT INTO `messages` (`author`, `message`, `receiver`, `created_at`) VALUES ('26', 'lol', 25, '2024-02-22 22:25:46')