app/Controllers/pnp/Order.php

    public function saveClientOrder() {
        $id = $this->request->getVar('id');
        $clientID = $this->request->getVar('client_id');
        $asin = $this->request->getVar('asin');
        $this->assignModel->set('order_id', $clientID)
            ->set('assigned_date', date('Y-m-d'))
            ->set('updated_at', date('Y-m-d H:i:s'))
            ->where('id', $id)
            ->update();

        $user = $this->userModel->find(session()->get('user_id'));

        $client = $this->clientModel->where('id', $clientID)->get();
        $client = $client->getFirstRow();

        $getTotalCost = $this->orderModel->getTotalCost($id);

        $this->logModel->save([
            'user_id' => $user['id'],
            'title' => 'assignments',
            'description' => '['. strtoupper($user['role']) .'] '. $user['username']. ' assigned items to '. $client->client_name .' ('. $client->company .')',
            'items' => $asin,
            'level' => '2',
            'created_at' => date('Y-m-d H:i:s')
        ]);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '26'
SELECT *
FROM `clients`
WHERE `id` = '16'
INSERT INTO `logs` (`user_id`, `title`, `description`, `items`, `level`, `created_at`) VALUES ('26', 'assignments', '[]  assigned items to Sent To Amazon (Sent To Amazon)', NULL, '2', '2023-12-28 02:37:44')