app/Models/pnp/AssignModel.php

SELECT `orders_status`.*, `lead_lists`.`id` as `lid`, `shipment_details`.`id` as `sid`, `shipment_details`.`created_at` as `sent_date`, `lead_lists`.`title`, `lead_lists`.`asin`, `market_price`, `purchase_items`.`qty` as `qty_ordered`, `buy_cost`, `purchase_items`.`lead_id` as `uid`, `purchase_items`.`id` as `pid`, `client_name`, `company`, `assigned_items`.*, `assigned_items`.`id` as `aid`
FROM `orders_status`
JOIN `purchase_items` ON `purchase_items`.`id` = `orders_status`.`purchased_item_id`
JOIN `assigned_items` ON `assigned_items`.`item_id` = `purchase_items`.`id`
JOIN `lead_lists` ON `lead_lists`.`id` = `purchase_items`.`lead_id`
JOIN `users` ON `lead_lists`.`file_id` = `users`.`id`
LEFT JOIN `clients` ON `clients`.`id` = `assigned_items`.`order_id`
LEFT JOIN `shipment_details` ON `shipment_details`.`assigned_id` = `assigned_items`.`id`
WHERE `purchase_items`.`activation` = '1'
AND `lead_lists`.`file_id` = '26'
GROUP BY `assigned_items`.`item_id`, `orders_status`.`id`
ORDER BY `assigned_items`.`item_id` DESC
---
    public function getAssignedData2($start = null, $end = null, $user = null) {
        if (is_null($start)) {
            $query = $this->db->table('orders_status')
                ->select('orders_status.*, lead_lists.id as lid, shipment_details.id as sid, shipment_details.created_at as sent_date, lead_lists.title, lead_lists.asin, market_price, purchase_items.qty as qty_ordered, buy_cost, purchase_items.lead_id as uid, purchase_items.id as pid, client_name, company, assigned_items.*, assigned_items.id as aid')
                ->join('purchase_items', 'purchase_items.id = orders_status.purchased_item_id')
                ->join('assigned_items', 'assigned_items.item_id = purchase_items.id')
                ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id')
                ->join('users', 'lead_lists.file_id = users.id')
                ->join('clients', 'clients.id = assigned_items.order_id', 'left')
                ->join('shipment_details', 'shipment_details.assigned_id = assigned_items.id', 'left')
                ->where('purchase_items.activation', '1')
                ->where('lead_lists.file_id', session()->get('user_id'))
                ->groupBy('assigned_items.item_id')
                ->groupBy('orders_status.id')
                ->orderBy('assigned_items.item_id', 'DESC')
                ->get();