app/Models/pnp/AssignModel.php

SELECT `orders_status`.*, `lead_lists`.`id` as `lid`, `shipment_details`.`id` as `sid`, `shipment_details`.`created_at` as `sent_date`, `lead_lists`.`title`, `lead_lists`.`asin`, `market_price`, `purchase_items`.`qty` as `qty_ordered`, `buy_cost`, `purchase_items`.`lead_id` as `uid`, `purchase_items`.`id` as `pid`, `client_name`, `company`, `assigned_items`.*, `assigned_items`.`id` as `aid`
FROM `orders_status`
JOIN `purchase_items` ON `purchase_items`.`id` = `orders_status`.`purchased_item_id`
JOIN `assigned_items` ON `assigned_items`.`item_id` = `purchase_items`.`id`
JOIN `lead_lists` ON `lead_lists`.`id` = `purchase_items`.`lead_id`
JOIN `users` ON `lead_lists`.`file_id` = `users`.`id`
LEFT JOIN `clients` ON `clients`.`id` = `assigned_items`.`order_id`
LEFT JOIN `shipment_details` ON `shipment_details`.`assigned_id` = `assigned_items`.`id`
WHERE `purchase_items`.`activation` = '1'
AND `lead_lists`.`file_id` = '26'
GROUP BY `assigned_items`.`item_id`, `orders_status`.`id`
ORDER BY `purchased_date` DESC, `title` DESC
---
    public function getAssignedData2($start = null, $end = null, $user = null) {
        if (is_null($start)) {
            $query = $this->db->table('orders_status')
                ->select('orders_status.*, lead_lists.id as lid, shipment_details.id as sid, shipment_details.created_at as sent_date, lead_lists.title, lead_lists.asin, market_price, purchase_items.qty as qty_ordered, buy_cost, purchase_items.lead_id as uid, purchase_items.id as pid, client_name, company, assigned_items.*, assigned_items.id as aid')
                ->join('purchase_items', 'purchase_items.id = orders_status.purchased_item_id')
                ->join('assigned_items', 'assigned_items.item_id = purchase_items.id')
                ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id')
                ->join('users', 'lead_lists.file_id = users.id')
                ->join('clients', 'clients.id = assigned_items.order_id', 'left')
                ->join('shipment_details', 'shipment_details.assigned_id = assigned_items.id', 'left')
                ->where('purchase_items.activation', '1')
                ->where('lead_lists.file_id', session()->get('user_id'))
                ->groupBy('assigned_items.item_id')
                ->groupBy('orders_status.id')
                ->orderBy('purchased_date, title', 'DESC')
                ->get();

SELECT `orders_status`.*, `lead_lists`.`id` as `lid`, `shipment_details`.`id` as `sid`, `shipment_details`.`created_at` as `sent_date`, `lead_lists`.`title`, `lead_lists`.`asin`, `market_price`, `purchase_items`.`qty` as `qty_ordered`, `buy_cost`, `purchase_items`.`lead_id` as `uid`, `purchase_items`.`id` as `pid`, `client_name`, `company`, `assigned_items`.*, `assigned_items`.`id` as `aid`
FROM `orders_status`
JOIN `purchase_items` ON `purchase_items`.`id` = `orders_status`.`purchased_item_id`
JOIN `assigned_items` ON `assigned_items`.`item_id` = `purchase_items`.`id`
JOIN `lead_lists` ON `lead_lists`.`id` = `purchase_items`.`lead_id`
JOIN `users` ON `lead_lists`.`file_id` = `users`.`id`
LEFT JOIN `clients` ON `clients`.`id` = `assigned_items`.`order_id`
LEFT JOIN `shipment_details` ON `shipment_details`.`assigned_id` = `assigned_items`.`id`
WHERE `purchase_items`.`activation` = '1'
AND `lead_lists`.`file_id` = '32'
GROUP BY `assigned_items`.`id`
ORDER BY `assigned_items`.`item_id` DESC
SELECT `orders_status`.*, `lead_lists`.`id` as `lid`, `shipment_details`.`id` as `sid`, `shipment_details`.`created_at` as `sent_date`, `lead_lists`.`title`, `lead_lists`.`asin`, `market_price`, `purchase_items`.`qty` as `qty_ordered`, `buy_cost`, `purchase_items`.`lead_id` as `uid`, `purchase_items`.`id` as `pid`, `client_name`, `company`, `assigned_items`.*, `assigned_items`.`id` as `aid`
FROM `orders_status`
JOIN `purchase_items` ON `purchase_items`.`id` = `orders_status`.`purchased_item_id`
JOIN `assigned_items` ON `assigned_items`.`item_id` = `purchase_items`.`id`
JOIN `lead_lists` ON `lead_lists`.`id` = `purchase_items`.`lead_id`
JOIN `users` ON `lead_lists`.`file_id` = `users`.`id`
LEFT JOIN `clients` ON `clients`.`id` = `assigned_items`.`order_id`
LEFT JOIN `shipment_details` ON `shipment_details`.`assigned_id` = `assigned_items`.`id`
WHERE DATE(orders_status.allocated_date) = '2023-12-18'
AND `purchase_items`.`activation` = '1'
AND `lead_lists`.`file_id` = '32'
GROUP BY `assigned_items`.`id`
ORDER BY `assigned_items`.`item_id` DESC
SELECT `orders_status`.*, `lead_lists`.`id` as `lid`, `shipment_details`.`id` as `sid`, `shipment_details`.`created_at` as `sent_date`, `lead_lists`.`title`, `lead_lists`.`asin`, `market_price`, `purchase_items`.`qty` as `qty_ordered`, `buy_cost`, `purchase_items`.`lead_id` as `uid`, `purchase_items`.`id` as `pid`, `client_name`, `company`, `assigned_items`.*, `assigned_items`.`id` as `aid`
FROM `orders_status`
JOIN `purchase_items` ON `purchase_items`.`id` = `orders_status`.`purchased_item_id`
JOIN `assigned_items` ON `assigned_items`.`item_id` = `purchase_items`.`id`
JOIN `lead_lists` ON `lead_lists`.`id` = `purchase_items`.`lead_id`
JOIN `users` ON `lead_lists`.`file_id` = `users`.`id`
LEFT JOIN `clients` ON `clients`.`id` = `assigned_items`.`order_id`
LEFT JOIN `shipment_details` ON `shipment_details`.`assigned_id` = `assigned_items`.`id`
WHERE DATE(orders_status.allocated_date) >= '2023-12-26'
AND DATE(orders_status.allocated_date) <= '2023-12-27'
AND `purchase_items`.`activation` = '1'
AND `lead_lists`.`file_id` = '26'
GROUP BY `assigned_items`.`id`
ORDER BY `assigned_items`.`item_id` DESC
---
    public function getAssignmentData($start = null, $end = null) {
        if (is_null($start)) {
            $query = $this->db->table('orders_status')
                ->select('orders_status.*, lead_lists.id as lid, shipment_details.id as sid, shipment_details.created_at as sent_date, lead_lists.title, lead_lists.asin, market_price, purchase_items.qty as qty_ordered, buy_cost, purchase_items.lead_id as uid, purchase_items.id as pid, client_name, company, assigned_items.*, assigned_items.id as aid')
                ->join('purchase_items', 'purchase_items.id = orders_status.purchased_item_id')
                ->join('assigned_items', 'assigned_items.item_id = purchase_items.id')
                ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id')
                ->join('users', 'lead_lists.file_id = users.id')
                ->join('clients', 'clients.id = assigned_items.order_id', 'left')
                ->join('shipment_details', 'shipment_details.assigned_id = assigned_items.id', 'left')
                ->where('purchase_items.activation', '1')
                ->where('lead_lists.file_id', session()->get('user_id'))
                ->groupBy('assigned_items.id')
                ->orderBy('assigned_items.item_id', 'DESC')
                ->get();
        } else {
            if (is_null($end)) {
                $query = $this->db->table('orders_status')
                ->select('orders_status.*, lead_lists.id as lid, shipment_details.id as sid, shipment_details.created_at as sent_date, lead_lists.title, lead_lists.asin, market_price, purchase_items.qty as qty_ordered, buy_cost, purchase_items.lead_id as uid, purchase_items.id as pid, client_name, company, assigned_items.*, assigned_items.id as aid')
                ->join('purchase_items', 'purchase_items.id = orders_status.purchased_item_id')
                ->join('assigned_items', 'assigned_items.item_id = purchase_items.id')
                ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id')
                ->join('users', 'lead_lists.file_id = users.id')
                ->join('clients', 'clients.id = assigned_items.order_id', 'left')
                ->join('shipment_details', 'shipment_details.assigned_id = assigned_items.id', 'left')
                ->where('DATE(orders_status.allocated_date)', $start)
                ->where('purchase_items.activation', '1')
                ->where('lead_lists.file_id', session()->get('user_id'))
                ->groupBy('assigned_items.id')
                ->orderBy('assigned_items.item_id', 'DESC')
                ->get();
            } else {
                $query = $this->db->table('orders_status')
                ->select('orders_status.*, lead_lists.id as lid, shipment_details.id as sid, shipment_details.created_at as sent_date, lead_lists.title, lead_lists.asin, market_price, purchase_items.qty as qty_ordered, buy_cost, purchase_items.lead_id as uid, purchase_items.id as pid, client_name, company, assigned_items.*, assigned_items.id as aid')
                ->join('purchase_items', 'purchase_items.id = orders_status.purchased_item_id')
                ->join('assigned_items', 'assigned_items.item_id = purchase_items.id')
                ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id')
                ->join('users', 'lead_lists.file_id = users.id')
                ->join('clients', 'clients.id = assigned_items.order_id', 'left')
                ->join('shipment_details', 'shipment_details.assigned_id = assigned_items.id', 'left')
                ->where('DATE(orders_status.allocated_date) >=', $start)
                ->where('DATE(orders_status.allocated_date) <=', $end)
                ->where('purchase_items.activation', '1')
                ->where('lead_lists.file_id', session()->get('user_id'))
                ->groupBy('assigned_items.id')
                ->orderBy('assigned_items.item_id', 'DESC')
                ->get();

SELECT `orders_status`.*, `lead_lists`.`id` as `lid`, `lead_lists`.`title`, `lead_lists`.`asin`, `market_price`, `purchase_items`.`qty` as `qty_ordered`, `buy_cost`, `purchase_items`.`lead_id` as `uid`, `purchase_items`.`id` as `pid`, `client_name`, `company`, `assigned_items`.*, `assigned_items`.`id` as `aid`, `shipments`.`id` as `sid`, `shipments`.`fba_number`, `shipments`.`shipment_number`, `assigned_date`
FROM `shipment_details`
JOIN `assigned_items` ON `shipment_details`.`assigned_id` = `assigned_items`.`id`
JOIN `shipments` ON `shipments`.`id` = `shipment_details`.`shipment_id`
JOIN `purchase_items` ON `assigned_items`.`item_id` = `purchase_items`.`id`
JOIN `orders_status` ON `orders_status`.`purchased_item_id` = `purchase_items`.`id`
JOIN `clients` ON `clients`.`id` = `assigned_items`.`order_id`
JOIN `lead_lists` ON `lead_lists`.`id` = `purchase_items`.`lead_id`
JOIN `users` ON `lead_lists`.`file_id` = `users`.`id`
WHERE DATE(assigned_items.assigned_date) >= '2023-12-21'
AND DATE(assigned_items.assigned_date) <= '2023-12-28'
AND assigned_items.order_id is NOT NULL
AND `assigned_items`.`order_id` != 0
AND `purchase_items`.`activation` = '1'
AND `lead_lists`.`file_id` = '26'
GROUP BY `assigned_items`.`id`
ORDER BY `assigned_items`.`order_id` ASC, `assigned_items`.`assigned_date` ASC
---
                ->orderBy('assigned_items.order_id, assigned_items.assigned_date', 'ASC')
                ->get();
            } else {
                $query = $this->db->table('shipment_details')
                ->select('orders_status.*, lead_lists.id as lid, lead_lists.title, lead_lists.asin, market_price, purchase_items.qty as qty_ordered, buy_cost, purchase_items.lead_id as uid, purchase_items.id as pid, client_name, company, assigned_items.*, assigned_items.id as aid, shipments.id as sid, shipments.fba_number, shipments.shipment_number, assigned_date')
                ->join('assigned_items', 'shipment_details.assigned_id = assigned_items.id')
                ->join('shipments', 'shipments.id = shipment_details.shipment_id')
                ->join('purchase_items', 'assigned_items.item_id = purchase_items.id')
                ->join('orders_status', 'orders_status.purchased_item_id = purchase_items.id')
                ->join('clients', 'clients.id = assigned_items.order_id')
                ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id')
                ->join('users', 'lead_lists.file_id = users.id')
                ->groupBy('assigned_items.id')
                ->where('DATE(assigned_items.assigned_date) >=', $start)
                ->where('DATE(assigned_items.assigned_date) <=', $end)
                ->where('assigned_items.order_id is NOT NULL', NULL, FALSE)
                ->where('assigned_items.order_id != 0 ')
                ->where('purchase_items.activation', '1')
                ->where('lead_lists.file_id', session()->get('user_id'))
                ->orderBy('assigned_items.order_id, assigned_items.assigned_date', 'ASC')
                ->get();

SELECT DATE(purchase_items.created_at), SUM(purchase_items.qty) as total_qty, SUM(purchase_items.qty * market_price) as total_price
FROM `orders_status`
JOIN `purchase_items` ON `purchase_items`.`id` = `orders_status`.`purchased_item_id`
JOIN `lead_lists` ON `lead_lists`.`id` = `purchase_items`.`lead_id`
JOIN `users` ON `lead_lists`.`file_id` = `users`.`id`
WHERE DATE(purchase_items.created_at) = DATE(CURDATE())
AND `purchase_items`.`activation` = '1'
AND `lead_lists`.`file_id` = '26'
GROUP BY DATE(purchase_items.created_at)
ORDER BY `purchase_items`.`created_at` DESC
---
    public function getTotalQtyToday() {
        $query = $this->db->table('orders_status')
            ->select('DATE(purchase_items.created_at), SUM(purchase_items.qty) as total_qty, SUM(purchase_items.qty * buy_cost) as total_price')
            ->join('purchase_items', 'purchase_items.id = orders_status.purchased_item_id')
            ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id')
            ->join('users', 'lead_lists.file_id = users.id')
            ->where('DATE(purchase_items.created_at) = DATE(CURDATE())')
            ->where('purchase_items.activation', '1')
            ->where('lead_lists.file_id', session()->get('user_id'))
            ->groupBy('DATE(purchase_items.created_at)')
            ->orderBy('purchase_items.created_at', 'DESC')
            ->get();

SELECT `lead_lists`.`asin`, `lead_lists`.`title`, `lead_lists`.`buy_cost`, `lead_lists`.`market_price`, `lead_lists`.`profit`, `purchase_items`.`qty`
FROM `orders_status`
JOIN `purchase_items` ON `purchase_items`.`id` = `orders_status`.`purchased_item_id`
JOIN `lead_lists` ON `lead_lists`.`id` = `purchase_items`.`lead_id`
JOIN `users` ON `lead_lists`.`file_id` = `users`.`id`
WHERE DATE(purchase_items.created_at) = DATE(CURDATE())
AND `purchase_items`.`activation` = '1'
ORDER BY `purchase_items`.`created_at` DESC
---
    public function getPurchaseDataToday() {
        $query = $this->db->table('orders_status')
        ->select('lead_lists.asin, lead_lists.title, lead_lists.buy_cost, lead_lists.market_price, lead_lists.profit, purchase_items.qty ')
        ->join('purchase_items', 'purchase_items.id = orders_status.purchased_item_id')
        ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id')
        ->join('users', 'lead_lists.file_id = users.id')
        ->where('DATE(purchase_items.created_at) = DATE(CURDATE())')
        ->where('purchase_items.activation', '1')
        ->orderBy('purchase_items.created_at', 'DESC')
        ->get();

SELECT DATE(purchase_items.created_at) as day, SUM(purchase_items.qty * market_price) as total_price
FROM `orders_status`
JOIN `purchase_items` ON `purchase_items`.`id` = `orders_status`.`purchased_item_id`
JOIN `lead_lists` ON `lead_lists`.`id` = `purchase_items`.`lead_id`
JOIN `users` ON `lead_lists`.`file_id` = `users`.`id`
WHERE YEARWEEK(purchase_items.created_at, 1) = YEARWEEK(CURDATE(), 1)
AND `purchase_items`.`activation` = '1'
AND `lead_lists`.`file_id` = '26'
ORDER BY `purchase_items`.`created_at` DESC
---
    public function getTotalPurchaseWeek() {
        $query = $this->db->table('orders_status')
            ->select('DATE(purchase_items.created_at) as day, SUM(purchase_items.qty * buy_cost) as total_price')
            ->join('purchase_items', 'purchase_items.id = orders_status.purchased_item_id')
            ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id')
            ->join('users', 'lead_lists.file_id = users.id')
            ->where('YEARWEEK(purchase_items.created_at, 1) = YEARWEEK(CURDATE(), 1)')
            ->where('purchase_items.activation', '1')

SELECT DATE_FORMAT(purchase_items.created_at, "%d") as day, SUM(purchase_items.qty * market_price) as total_price
FROM `orders_status`
JOIN `purchase_items` ON `purchase_items`.`id` = `orders_status`.`purchased_item_id`
JOIN `lead_lists` ON `lead_lists`.`id` = `purchase_items`.`lead_id`
JOIN `users` ON `lead_lists`.`file_id` = `users`.`id`
WHERE MONTH(purchase_items.created_at) = MONTH(CURRENT_DATE())
AND YEAR(purchase_items.created_at) = YEAR(CURRENT_DATE())
AND `purchase_items`.`activation` = '1'
AND `lead_lists`.`file_id` = '26'
GROUP BY DATE(purchase_items.created_at)
ORDER BY `purchase_items`.`created_at` DESC
---
    public function getTotalPurchaseMonth() {
        $query = $this->db->table('orders_status')
            ->select('DATE_FORMAT(purchase_items.created_at, "%d") as day, SUM(purchase_items.qty * buy_cost) as total_price')
            ->join('purchase_items', 'purchase_items.id = orders_status.purchased_item_id')
            ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id')
            ->join('users', 'lead_lists.file_id = users.id')
            ->where('MONTH(purchase_items.created_at) = MONTH(CURRENT_DATE())')
            ->where('YEAR(purchase_items.created_at) = YEAR(CURRENT_DATE())')
            ->where('purchase_items.activation', '1')
            ->where('lead_lists.file_id', session()->get('user_id'))
            ->groupBy('DATE(purchase_items.created_at)')
            ->orderBy('purchase_items.created_at', 'DESC')
            ->get();

SELECT DATE_FORMAT(purchase_items.created_at, "%b") as month, SUM(purchase_items.qty * market_price) as total_price
FROM `orders_status`
JOIN `purchase_items` ON `purchase_items`.`id` = `orders_status`.`purchased_item_id`
JOIN `lead_lists` ON `lead_lists`.`id` = `purchase_items`.`lead_id`
JOIN `users` ON `lead_lists`.`file_id` = `users`.`id`
WHERE YEAR(purchase_items.created_at) = YEAR(CURRENT_DATE())
AND `purchase_items`.`activation` = '1'
AND `lead_lists`.`file_id` = '26'
GROUP BY YEAR(purchase_items.created_at), MONTH(purchase_items.created_at)
ORDER BY `purchase_items`.`created_at` DESC
---
    public function getTotalPurchaseYear() {
        $query = $this->db->table('orders_status')
            ->select('DATE_FORMAT(purchase_items.created_at, "%b") as month, SUM(purchase_items.qty * buy_cost) as total_price')
            ->join('purchase_items', 'purchase_items.id = orders_status.purchased_item_id')
            ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id')
            ->join('users', 'lead_lists.file_id = users.id')
            ->where('YEAR(purchase_items.created_at) = YEAR(CURRENT_DATE())')
            ->where('purchase_items.activation', '1')
            ->where('lead_lists.file_id', session()->get('user_id'))
            ->groupBy('YEAR(purchase_items.created_at), MONTH(purchase_items.created_at)')
            ->orderBy('purchase_items.created_at', 'DESC')
            ->get();

SELECT DATE(purchase_items.created_at) as day, SUM(qty_received - qty_remaining) as total_assigned
FROM `orders_status`
JOIN `purchase_items` ON `purchase_items`.`id` = `orders_status`.`purchased_item_id`
JOIN `lead_lists` ON `lead_lists`.`id` = `purchase_items`.`lead_id`
JOIN `users` ON `lead_lists`.`file_id` = `users`.`id`
WHERE YEARWEEK(purchase_items.created_at, 1) = YEARWEEK(CURDATE(), 1)
AND `purchase_items`.`activation` = '1'
AND `lead_lists`.`file_id` = '26'
GROUP BY DATE(purchase_items.created_at)
ORDER BY `purchase_items`.`created_at` DESC
---
    public function getTotalAssignWeek() {
        $query = $this->db->table('orders_status')
            ->select('DATE(purchase_items.created_at) as day, SUM(qty_received - qty_remaining) as total_assigned')
            ->join('purchase_items', 'purchase_items.id = orders_status.purchased_item_id')
            ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id')
            ->join('users', 'lead_lists.file_id = users.id')
            ->where('YEARWEEK(purchase_items.created_at, 1) = YEARWEEK(CURDATE(), 1)')
            ->where('purchase_items.activation', '1')
            ->where('lead_lists.file_id', session()->get('user_id'))
            ->groupBy('DATE(purchase_items.created_at)')
            ->orderBy('purchase_items.created_at', 'DESC')
            ->get();

SELECT DATE_FORMAT(purchase_items.created_at, "%d") as day, SUM(qty_received - qty_remaining) as total_assigned
FROM `orders_status`
JOIN `purchase_items` ON `purchase_items`.`id` = `orders_status`.`purchased_item_id`
JOIN `lead_lists` ON `lead_lists`.`id` = `purchase_items`.`lead_id`
JOIN `users` ON `lead_lists`.`file_id` = `users`.`id`
WHERE MONTH(purchase_items.created_at) = MONTH(CURRENT_DATE())
AND YEAR(purchase_items.created_at) = YEAR(CURRENT_DATE())
AND `purchase_items`.`activation` = '1'
AND `lead_lists`.`file_id` = '26'
GROUP BY DATE(purchase_items.created_at)
ORDER BY `purchase_items`.`created_at` DESC
---
    public function getTotalAssignedMonth() {
        $query = $this->db->table('orders_status')
            ->select('DATE_FORMAT(purchase_items.created_at, "%d") as day, SUM(qty_received - qty_remaining) as total_assigned')
            ->join('purchase_items', 'purchase_items.id = orders_status.purchased_item_id')
            ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id')
            ->join('users', 'lead_lists.file_id = users.id')
            ->where('MONTH(purchase_items.created_at) = MONTH(CURRENT_DATE())')
            ->where('YEAR(purchase_items.created_at) = YEAR(CURRENT_DATE())')
            ->where('purchase_items.activation', '1')
            ->where('lead_lists.file_id', session()->get('user_id'))
            ->groupBy('DATE(purchase_items.created_at)')
            ->orderBy('purchase_items.created_at', 'DESC')
            ->get();

SELECT DATE_FORMAT(purchase_items.created_at, "%b") as month, SUM(qty_received - qty_remaining) as total_assigned
FROM `orders_status`
JOIN `purchase_items` ON `purchase_items`.`id` = `orders_status`.`purchased_item_id`
JOIN `lead_lists` ON `lead_lists`.`id` = `purchase_items`.`lead_id`
JOIN `users` ON `lead_lists`.`file_id` = `users`.`id`
WHERE YEAR(purchase_items.created_at) = YEAR(CURRENT_DATE())
AND `purchase_items`.`activation` = '1'
AND `lead_lists`.`file_id` = '26'
GROUP BY YEAR(purchase_items.created_at), MONTH(purchase_items.created_at)
ORDER BY `purchase_items`.`created_at` DESC
---
    public function getTotalAssignedYear() {
        $query = $this->db->table('orders_status')
            ->select('DATE_FORMAT(purchase_items.created_at, "%b") as month, SUM(qty_received - qty_remaining) as total_assigned')
            ->join('purchase_items', 'purchase_items.id = orders_status.purchased_item_id')
            ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id')
            ->join('users', 'lead_lists.file_id = users.id')
            ->where('YEAR(purchase_items.created_at) = YEAR(CURRENT_DATE())')
            ->where('purchase_items.activation', '1')
            ->where('lead_lists.file_id', session()->get('user_id'))
            ->groupBy('YEAR(purchase_items.created_at), MONTH(purchase_items.created_at)')
            ->orderBy('purchase_items.created_at', 'DESC')
            ->get();

SELECT DATE(purchase_items.created_at) as day, SUM((qty_received - qty_remaining) * buy_cost) as total_cost
FROM `orders_status`
JOIN `purchase_items` ON `purchase_items`.`id` = `orders_status`.`purchased_item_id`
JOIN `lead_lists` ON `lead_lists`.`id` = `purchase_items`.`lead_id`
JOIN `users` ON `lead_lists`.`file_id` = `users`.`id`
WHERE YEARWEEK(purchase_items.created_at, 1) = YEARWEEK(CURDATE(), 1)
AND `purchase_items`.`activation` = '1'
AND `lead_lists`.`file_id` = '26'
GROUP BY DATE(purchase_items.created_at)
ORDER BY `purchase_items`.`created_at` DESC
---
    public function getTotalNTUWeek() {
        $query = $this->db->table('orders_status')
            ->select('DATE(purchase_items.created_at) as day, SUM((qty_received - qty_remaining) * buy_cost) as total_cost')
            ->join('purchase_items', 'purchase_items.id = orders_status.purchased_item_id')
            ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id')
            ->join('users', 'lead_lists.file_id = users.id')
            ->where('YEARWEEK(purchase_items.created_at, 1) = YEARWEEK(CURDATE(), 1)')
            ->where('purchase_items.activation', '1')
            ->where('lead_lists.file_id', session()->get('user_id'))
            ->groupBy('DATE(purchase_items.created_at)')
            ->orderBy('purchase_items.created_at', 'DESC')
            ->get();

SELECT DATE_FORMAT(purchase_items.created_at, "%d") as day, SUM((qty_received - qty_remaining) * buy_cost) as total_cost
FROM `orders_status`
JOIN `purchase_items` ON `purchase_items`.`id` = `orders_status`.`purchased_item_id`
JOIN `lead_lists` ON `lead_lists`.`id` = `purchase_items`.`lead_id`
JOIN `users` ON `lead_lists`.`file_id` = `users`.`id`
WHERE MONTH(purchase_items.created_at) = MONTH(CURRENT_DATE())
AND YEAR(purchase_items.created_at) = YEAR(CURRENT_DATE())
AND `purchase_items`.`activation` = '1'
AND `lead_lists`.`file_id` = '26'
GROUP BY DATE(purchase_items.created_at)
ORDER BY `purchase_items`.`created_at` DESC
---
    public function getTotalNTUMonth() {
        $query = $this->db->table('orders_status')
            ->select('DATE_FORMAT(purchase_items.created_at, "%d") as day, SUM((qty_received - qty_remaining) * buy_cost) as total_cost')
            ->join('purchase_items', 'purchase_items.id = orders_status.purchased_item_id')
            ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id')
            ->join('users', 'lead_lists.file_id = users.id')
            ->where('MONTH(purchase_items.created_at) = MONTH(CURRENT_DATE())')
            ->where('YEAR(purchase_items.created_at) = YEAR(CURRENT_DATE())')
            ->where('purchase_items.activation', '1')
            ->where('lead_lists.file_id', session()->get('user_id'))
            ->groupBy('DATE(purchase_items.created_at)')
            ->orderBy('purchase_items.created_at', 'DESC')
            ->get();

SELECT DATE_FORMAT(purchase_items.created_at, "%b") as month, SUM((qty_received - qty_remaining) * buy_cost) as total_cost
FROM `orders_status`
JOIN `purchase_items` ON `purchase_items`.`id` = `orders_status`.`purchased_item_id`
JOIN `lead_lists` ON `lead_lists`.`id` = `purchase_items`.`lead_id`
JOIN `users` ON `lead_lists`.`file_id` = `users`.`id`
WHERE YEAR(purchase_items.created_at) = YEAR(CURRENT_DATE())
AND `purchase_items`.`activation` = '1'
AND `lead_lists`.`file_id` = '26'
GROUP BY YEAR(purchase_items.created_at), MONTH(purchase_items.created_at)
ORDER BY `purchase_items`.`created_at` DESC
---
    public function getTotalNTUYear() {
        $query = $this->db->table('orders_status')
            ->select('DATE_FORMAT(purchase_items.created_at, "%b") as month, SUM((qty_received - qty_remaining) * buy_cost) as total_cost')
            ->join('purchase_items', 'purchase_items.id = orders_status.purchased_item_id')
            ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id')
            ->join('users', 'lead_lists.file_id = users.id')
            ->where('YEAR(purchase_items.created_at) = YEAR(CURRENT_DATE())')
            ->where('purchase_items.activation', '1')
            ->where('lead_lists.file_id', session()->get('user_id'))
            ->groupBy('YEAR(purchase_items.created_at), MONTH(purchase_items.created_at)')
            ->orderBy('purchase_items.created_at', 'DESC')
            ->get();