app/Models/pnp/BoxModel.php

SELECT `boxes`.*
FROM `boxes`
JOIN `assigned_items` ON `assigned_items`.`id` = `boxes`.`assign_id`
JOIN `purchase_items` ON `assigned_items`.`item_id` = `purchase_items`.`id`
JOIN `orders_status` ON `purchase_items`.`id` = `orders_status`.`purchased_item_id`
WHERE DATE(orders_status.allocated_date) >= '2023-12-26'
AND DATE(orders_status.allocated_date) <= '2023-12-27'
---
    public function getBoxes($start = null, $end = null) {
        if (is_null($start)) {
            $query = $this->db->table('boxes')
                ->select('boxes.*')
                ->join('assigned_items', 'assigned_items.id = boxes.assign_id')
                ->join('purchase_items', 'assigned_items.item_id = purchase_items.id')
                ->join('orders_status', 'purchase_items.id = orders_status.purchased_item_id')
                ->get();
        } else {
            if (is_null($end)) {
                $query = $this->db->table('boxes')
                ->select('boxes.*')
                    ->join('assigned_items', 'assigned_items.id = boxes.assign_id')
                    ->join('purchase_items', 'assigned_items.item_id = purchase_items.id')
                    ->join('orders_status', 'purchase_items.id = orders_status.purchased_item_id')
                    ->where('DATE(orders_status.allocated_date)', $start)
                    ->get();
            } else {
                $query = $this->db->table('boxes')
                    ->select('boxes.*')
                    ->join('assigned_items', 'assigned_items.id = boxes.assign_id')
                    ->join('purchase_items', 'assigned_items.item_id = purchase_items.id')
                    ->join('orders_status', 'purchase_items.id = orders_status.purchased_item_id')
                    ->where('DATE(orders_status.allocated_date) >=', $start)
                    ->where('DATE(orders_status.allocated_date) <=', $end)
                    ->get();

SELECT *
FROM `boxes`
JOIN `assigned_items` ON `assigned_items`.`id` = `boxes`.`assign_id`
JOIN `purchase_items` ON `assigned_items`.`item_id` = `purchase_items`.`id`
JOIN `lead_lists` ON `lead_lists`.`id` = `purchase_items`.`lead_id`
JOIN `clients` ON `clients`.`id` = `assigned_items`.`order_id`
JOIN `orders_status` ON `orders_status`.`purchased_item_id` = `purchase_items`.`id`
WHERE `ntu_date` IS NOT NULL
AND DATE(ntu_date) >= '2023-12-21'
AND DATE(ntu_date) <= '2023-12-28'
AND assigned_items.order_id is NOT NULL
AND `assigned_items`.`order_id` != 0
AND `purchase_items`.`activation` = '1'
AND `lead_lists`.`file_id` = '26'
ORDER BY `boxes`.`box_name`
---
    public function getAllBox($start = null, $end = null) {
        if (is_null($start)) {
            $query = $this->db->table('boxes')
                ->join('assigned_items', 'assigned_items.id = boxes.assign_id')
                ->join('purchase_items', 'assigned_items.item_id = purchase_items.id')
                ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id')
                ->join('clients', 'clients.id = assigned_items.order_id')
                ->join('orders_status', 'orders_status.purchased_item_id = purchase_items.id')
                ->where('ntu_date IS NOT NULL')
                ->where('DATE(ntu_date) >= CURDATE() - INTERVAL 8 day')
                ->where('assigned_items.order_id is NOT NULL', NULL, FALSE)
                ->where('assigned_items.order_id != 0 ')
                ->where('purchase_items.activation', '1')
                ->where('lead_lists.file_id', session()->get('user_id'))
                ->orderBy('boxes.box_name')
                ->get();
        } else {
            $query = $this->db->table('boxes')
                ->join('assigned_items', 'assigned_items.id = boxes.assign_id')
                ->join('purchase_items', 'assigned_items.item_id = purchase_items.id')
                ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id')
                ->join('clients', 'clients.id = assigned_items.order_id')
                ->join('orders_status', 'orders_status.purchased_item_id = purchase_items.id')
                ->where('ntu_date IS NOT NULL')
                ->where('DATE(ntu_date) >=', $start)
                ->where('DATE(ntu_date) <=', $end)
                ->where('assigned_items.order_id is NOT NULL', NULL, FALSE)
                ->where('assigned_items.order_id != 0 ')
                ->where('purchase_items.activation', '1')
                ->where('lead_lists.file_id', session()->get('user_id'))
                ->orderBy('boxes.box_name')
                ->get();