app/Models/pnp/BuyerModel.php

    public function getCCUsage($start = null, $end = null) {
        if (is_null($start)) {
            $query = $this->db->table('buyer_details')
                ->select('buyers.id, buyer_name, buyer_details.cc as cc, SUM(buyer_details.buyer_qty) as total_qty, SUM(buy_cost) as buy_cost, SUM(buy_cost * buyer_details.buyer_qty) as total_buy_cost')
                ->join('buyers', 'buyers.id = buyer_details.buyer')
                ->join('purchase_items', 'purchase_items.id = buyer_details.purchase_id')
                ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id')
                // ->join('files', 'lead_lists.file_id = files.id')
                ->where('MONTH(purchase_items.created_at) = MONTH(CURDATE())')
                // ->where('files.activation', 'actived')
                // ->where('files.oauth_uid', session()->get('oauth_uid'))
                ->where('lead_lists.file_id', session()->get('user_id'))
                ->groupBy('buyer_details.cc')
                ->get();
        } else {
            $query = $this->db->table('buyer_details')
                ->select('buyers.id, buyer_name, buyer_details.cc as cc, SUM(buyer_details.buyer_qty) as total_qty, SUM(buy_cost) as buy_cost, SUM(buy_cost * buyer_details.buyer_qty) as total_buy_cost')
                ->join('buyers', 'buyers.id = buyer_details.buyer')
                ->join('purchase_items', 'purchase_items.id = buyer_details.purchase_id')
                ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id')
---
SELECT `buyers`.`id`, `buyer_name`, `buyer_details`.`cc` as `cc`, SUM(buyer_details.buyer_qty) as total_qty, SUM(buy_cost) as buy_cost, SUM(buy_cost * buyer_details.buyer_qty) as total_buy_cost
FROM `buyer_details`
JOIN `buyers` ON `buyers`.`id` = `buyer_details`.`buyer`
JOIN `purchase_items` ON `purchase_items`.`id` = `buyer_details`.`purchase_id`
JOIN `lead_lists` ON `lead_lists`.`id` = `purchase_items`.`lead_id`
WHERE `purchase_items`.`created_at` >= '2023-12-01 00:00:00'
AND `purchase_items`.`created_at` <= '2023-12-27 23:59:59'
AND `lead_lists`.`file_id` = '26'
GROUP BY `buyer_details`.`cc`