app/Models/pnp/ClientModel.php

    public function getClients($id) {
        $query = $this->db->table('clients')
            ->select('clients.*, SUM(assigned_items.qty * lead_lists.buy_cost) as total_cost, SUM(assigned_items.qty) as qty')
            ->join('assigned_items', 'assigned_items.order_id = clients.id', 'left')
            ->join('purchase_items', 'purchase_items.id = assigned_items.item_id', 'left')
            ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id', 'left')
            ->join('users', 'users.id = clients.oauth_uid')
            ->where('users.id', $id)
---
SELECT `clients`.*, SUM(assigned_items.qty * lead_lists.buy_cost) as total_cost, SUM(assigned_items.qty) as qty
FROM `clients`
LEFT JOIN `assigned_items` ON `assigned_items`.`order_id` = `clients`.`id`
LEFT JOIN `purchase_items` ON `purchase_items`.`id` = `assigned_items`.`item_id`
LEFT JOIN `lead_lists` ON `lead_lists`.`id` = `purchase_items`.`lead_id`
JOIN `users` ON `users`.`id` = `clients`.`oauth_uid`
WHERE `users`.`id` = '26'
GROUP BY `clients`.`id`
ORDER BY `clients`.`id` DESC

    public function getClientCostLeft($id) {
        $query = $this->db->table('clients')
            ->select('(total_order - SUM(assigned_items.qty * lead_lists.buy_cost)) as cost_left')
            ->join('assigned_items', 'assigned_items.order_id = clients.id', 'left')
            ->join('purchase_items', 'purchase_items.id = assigned_items.item_id', 'left')
            ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id', 'left')
            ->join('users', 'users.id = clients.oauth_uid')
            ->where('clients.id', $id)
            ->where('purchase_items.activation', '1')
            ->orderBy('clients.id', 'DESC')
            ->groupBy('clients.id')
            ->get();
---
SELECT (total_order - SUM(assigned_items.qty * lead_lists.buy_cost)) as cost_left
FROM `clients`
LEFT JOIN `assigned_items` ON `assigned_items`.`order_id` = `clients`.`id`
LEFT JOIN `purchase_items` ON `purchase_items`.`id` = `assigned_items`.`item_id`
LEFT JOIN `lead_lists` ON `lead_lists`.`id` = `purchase_items`.`lead_id`
JOIN `users` ON `users`.`id` = `clients`.`oauth_uid`
WHERE `clients`.`id` = '16'
AND `purchase_items`.`activation` = '1'
GROUP BY `clients`.`id`
ORDER BY `clients`.`id` DESC

    public function getClientUnits($id, $start, $end) {
        if (is_null($end)) {
            $query = $this->db->table('purchase_items')
                ->select('SUM(qty_received) as total_unit, SUM(qty_returned) as total_return')
                ->join('orders_status', 'orders_status.purchased_item_id = purchase_items.id')
                ->where('purchase_items.order_staff', $id)
                ->where('purchase_items.created_at', $start)
                ->groupBy('purchase_items.order_staff')
                ->get();
        } else {
            $query = $this->db->table('purchase_items')
                ->select('SUM(qty_received) as total_unit, SUM(qty_returned) as total_return')
                ->join('orders_status', 'orders_status.purchased_item_id = purchase_items.id')
                ->where('purchase_items.order_staff', $id)
                ->where('purchase_items.created_at >=', $start)
                ->where('purchase_items.created_at <=', $end)
                ->groupBy('purchase_items.order_staff')
                ->get();
---
SELECT SUM(qty_received) as total_unit, SUM(qty_returned) as total_return
FROM `purchase_items`
JOIN `orders_status` ON `orders_status`.`purchased_item_id` = `purchase_items`.`id`
WHERE `purchase_items`.`order_staff` = '41'
AND `purchase_items`.`created_at` = '2024-04-02'
GROUP BY `purchase_items`.`order_staff`
SELECT SUM(qty_received) as total_unit, SUM(qty_returned) as total_return
FROM `purchase_items`
JOIN `orders_status` ON `orders_status`.`purchased_item_id` = `purchase_items`.`id`
WHERE `purchase_items`.`order_staff` = '41'
AND `purchase_items`.`created_at` >= '2024-02-01'
AND `purchase_items`.`created_at` <= '2024-04-30'
GROUP BY `purchase_items`.`order_staff`