app/Models/pnp/MessageModel.php

SELECT *
FROM `mail_notif`
WHERE `sender` = '26'
AND DATE(created_at) = '2024-02-22'
---
    public function checkMailNotif($sender) {
        $query = $this->db->table('mail_notif')
            ->where('sender', $sender)
            ->where('DATE(created_at)', date('Y-m-d'))
            ->get();