app/Models/pnp/OrderStatusModel.php

SELECT SUM(orders_status.qty_received) as total
FROM `orders_status`
JOIN `lead_lists` ON `lead_lists`.`id` = `orders_status`.`purchased_item_id`
WHERE `lead_lists`.`file_id` = '26'
AND `orders_status`.`status` = 'delivered'
---
    public function totalReceivedCompleted() {
        $query = $this->table('orders_status')
            ->select('SUM(orders_status.qty_received) as total')
            ->join('lead_lists', 'lead_lists.id = orders_status.purchased_item_id')
            ->where('lead_lists.file_id', session()->get('user_id'))
            ->where('orders_status.status', 'delivered')
            ->get();

SELECT SUM(purchase_items.qty - orders_status.qty_received) as total
FROM `orders_status`
JOIN `purchase_items` ON `purchase_items`.`id` = `orders_status`.`purchased_item_id`
JOIN `lead_lists` ON `lead_lists`.`id` = `orders_status`.`purchased_item_id`
WHERE `lead_lists`.`file_id` = '26'
AND `orders_status`.`status` != 'delivered'
---
    public function totalUnReceivedCompleted() {
        $query = $this->table('orders_status')
            ->select('SUM(purchase_items.qty - orders_status.qty_received) as total')
            ->join('purchase_items', 'purchase_items.id = orders_status.purchased_item_id')
            ->join('lead_lists', 'lead_lists.id = orders_status.purchased_item_id')
            ->where('lead_lists.file_id', session()->get('user_id'))
            ->where('orders_status.status !=', 'delivered')
            ->get();

SELECT SUM(orders_status.qty_received) as total
FROM `orders_status`
JOIN `lead_lists` ON `lead_lists`.`id` = `orders_status`.`purchased_item_id`
WHERE `lead_lists`.`file_id` = '26'
AND `orders_status`.`status` != 'delivered'
---
    public function totalReceivedUncompleted() {
        $query = $this->table('orders_status')
            ->select('SUM(orders_status.qty_received) as total')
            ->join('lead_lists', 'lead_lists.id = orders_status.purchased_item_id')
            ->where('lead_lists.file_id', session()->get('user_id'))
            ->where('orders_status.status !=', 'delivered')
            ->get();

SELECT SUM(orders_status.qty_remaining) as total
FROM `orders_status`
JOIN `purchase_items` ON `purchase_items`.`id` = `orders_status`.`purchased_item_id`
JOIN `lead_lists` ON `lead_lists`.`id` = `orders_status`.`purchased_item_id`
WHERE `lead_lists`.`file_id` = '26'
AND `orders_status`.`status` != 'delivered'
---
    public function totalUnassigned() {
        $query = $this->table('orders_status')
            ->select('SUM(orders_status.qty_remaining) as total')
            ->join('purchase_items', 'purchase_items.id = orders_status.purchased_item_id')
            ->join('lead_lists', 'lead_lists.id = orders_status.purchased_item_id')
            ->where('lead_lists.file_id', session()->get('user_id'))
            ->where('orders_status.status !=', 'delivered')
            ->get();

SELECT SUM(qty_received) as total_received
FROM `orders_status`
JOIN `purchase_items` ON `purchase_items`.`id` = `orders_status`.`purchased_item_id`
JOIN `lead_lists` ON `lead_lists`.`id` = `purchase_items`.`lead_id`
WHERE `lead_lists`.`file_id` = '26'
AND DATE(orders_status.received_date) = '2023-12-27'
GROUP BY `orders_status`.`id`
---
    public function getTotalReceived($date) {
        $query = $this->db->table('orders_status')
            ->select('SUM(qty_received) as total_received')
            ->join('purchase_items', 'purchase_items.id = orders_status.purchased_item_id')
            ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id')
            ->where('lead_lists.file_id', session()->get('user_id'))
            ->where('DATE(orders_status.received_date)', $date)
            ->groupBy('orders_status.id')
            ->get();

SELECT ABS((SUM(qty_received + IFNULL(qty_returned, 0))) - SUM(purchase_items.qty)) as total_unreceived
FROM `orders_status`
JOIN `purchase_items` ON `purchase_items`.`id` = `orders_status`.`purchased_item_id`
JOIN `lead_lists` ON `lead_lists`.`id` = `purchase_items`.`lead_id`
WHERE `lead_lists`.`file_id` = '26'
AND DATE(orders_status.received_date) = '2023-12-27'
GROUP BY `orders_status`.`id`
---
    public function getTotalUnreceived($date) {
        $query = $this->db->table('orders_status')
            ->select('ABS((SUM(qty_received + IFNULL(qty_returned, 0))) - SUM(purchase_items.qty)) as total_unreceived')
            ->join('purchase_items', 'purchase_items.id = orders_status.purchased_item_id')
            ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id')
            ->where('lead_lists.file_id', session()->get('user_id'))
            ->where('DATE(orders_status.received_date)', $date)
            ->groupBy('orders_status.id')
            ->get();

SELECT ABS((SUM(IFNULL(qty_returned, 0)))) as total_refund
FROM `orders_status`
JOIN `purchase_items` ON `purchase_items`.`id` = `orders_status`.`purchased_item_id`
JOIN `lead_lists` ON `lead_lists`.`id` = `purchase_items`.`lead_id`
WHERE `lead_lists`.`file_id` = '26'
AND DATE(orders_status.received_date) = '2023-12-27'
GROUP BY `orders_status`.`id`
---
    public function getTotalRefund($date) {
        $query = $this->db->table('orders_status')
        ->select('ABS((SUM(IFNULL(qty_returned, 0)))) as total_refund')
            ->join('purchase_items', 'purchase_items.id = orders_status.purchased_item_id')
            ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id')
            ->where('lead_lists.file_id', session()->get('user_id'))
            ->where('DATE(orders_status.received_date)', $date)
            ->groupBy('orders_status.id')
            ->get();