app/Models/pnp/OrderModel.php

    public function getPurchaseList($limit = null) {
        $query = $this->db->table('purchase_items')
            ->select('COUNT(purchase_items.lead_id) as purchased_item, purchase_items.created_at as purch_date')
            ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id')
            ->where('purchase_items.activation', '1')
            ->where('purchase_items.order_staff', session()->get('user_id'))
            ->groupBy('purchase_items.order_staff')
            ->groupBy('DATE(purchase_items.created_at)')
            ->orderBy('purchase_items.created_at', 'DESC')
            ->get();
---
SELECT COUNT(purchase_items.lead_id) as purchased_item, `purchase_items`.`created_at` as `purch_date`
FROM `purchase_items`
JOIN `lead_lists` ON `lead_lists`.`id` = `purchase_items`.`lead_id`
WHERE `purchase_items`.`activation` = '1'
AND `purchase_items`.`order_staff` = '32'
GROUP BY `purchase_items`.`order_staff`, DATE(purchase_items.created_at)
ORDER BY `purchase_items`.`created_at` DESC