app/Models/pnp/RefundModel.php

    public function getAllRefundItems($start = null, $end = null) {
        if (is_null($start)) {
            $query = $this->db->table('lead_lists')
                ->select('lead_lists.id, lead_lists.asin, lead_lists.title, qty_returned, purchased_date, refunds.shipping_cost, refunds.notes as shipping_notes')
                ->join('purchase_items', 'purchase_items.lead_id = lead_lists.id')
                ->join('orders_status', 'orders_status.purchased_item_id = purchase_items.id')
                ->join('refunds', 'refunds.lead_id = lead_lists.id', 'left')
                ->where('qty_returned >', 0)
                ->where('DATE(purchased_date) >= CURDATE() - INTERVAL 8 day')
                ->where('lead_lists.file_id', session()->get('user_id'))
                ->get();
        } else {
            $query = $this->db->table('lead_lists')
            ->select('lead_lists.id, lead_lists.asin, lead_lists.title, qty_returned, purchased_date, refunds.shipping_cost, refunds.notes as shipping_notes')
                ->join('purchase_items', 'purchase_items.lead_id = lead_lists.id')
                ->join('orders_status', 'orders_status.purchased_item_id = purchase_items.id')
                ->join('refunds', 'refunds.lead_id = lead_lists.id', 'left')
                ->where('qty_returned >', 0)
                ->where('DATE(purchased_date) >=', $start)
                ->where('DATE(purchased_date) <=', $end)
                ->where('lead_lists.file_id', session()->get('user_id'))
                ->get();
---
SELECT `lead_lists`.`id`, `lead_lists`.`asin`, `lead_lists`.`title`, `qty_returned`, `purchased_date`, `refunds`.`shipping_cost`, `refunds`.`notes` as `shipping_notes`
FROM `lead_lists`
JOIN `purchase_items` ON `purchase_items`.`lead_id` = `lead_lists`.`id`
JOIN `orders_status` ON `orders_status`.`purchased_item_id` = `purchase_items`.`id`
LEFT JOIN `refunds` ON `refunds`.`lead_id` = `lead_lists`.`id`
WHERE `qty_returned` > 0
AND DATE(purchased_date) >= '2023-12-23'
AND DATE(purchased_date) <= '2023-12-30'
AND `lead_lists`.`file_id` = '26'