app/Models/pnp/ShipmentModel.php

SELECT *
FROM `clients`
JOIN `assigned_items` ON `assigned_items`.`order_id` = `clients`.`id`
WHERE `assigned_items`.`item_id` = '39'
---
    public function findClient($id) {
        $query = $this->db->table('clients')
            ->join('assigned_items', 'assigned_items.order_id = clients.id')
            ->where('assigned_items.item_id', $id)
            ->get();