app/Models/pnp/TrackingModel.php

SELECT `lead_lists`.`asin`, `lead_lists`.`title`, `buyer_details`.`buyer_qty` as `qty`, `tracking_shipments`.*, `tracking_details`.`status`, `tracking_details`.`location`, `tracking_details`.`tracking_details`, `tracking_details`.`checkpoint_date`, `buyer_details`.`order_number`, `tracking_items`.`buyer_id`
FROM `tracking_shipments`
LEFT JOIN `tracking_details` ON `tracking_details`.`shipment_id` = `tracking_shipments`.`id`
LEFT JOIN `tracking_items` ON `tracking_items`.`shipment_id` = `tracking_shipments`.`id`
JOIN `buyer_details` ON `buyer_details`.`id` = `tracking_items`.`buyer_id`
JOIN `buyers` ON `buyers`.`id` = `buyer_details`.`buyer`
JOIN `purchase_items` ON `purchase_items`.`id` = `buyer_details`.`purchase_id`
JOIN `lead_lists` ON `lead_lists`.`id` = `purchase_items`.`lead_id`
JOIN `files` ON `files`.`id` = `lead_lists`.`file_id`
WHERE `files`.`activation` = 'actived'
AND `files`.`oauth_uid` = '26'
AND `tracking_shipments`.`created_at` >= '2023-12-18 00:00:00'
AND `tracking_shipments`.`created_at` <= '2023-12-18 23:59:59'
GROUP BY `tracking_shipments`.`id`
ORDER BY `tracking_shipments`.`id` DESC
---
    public function getAllShipments($start = null, $end = null) {
        $query = $this->db->table('tracking_shipments')
            ->select('lead_lists.asin, lead_lists.title, buyer_details.buyer_qty as qty, tracking_shipments.*, tracking_details.status, tracking_details.location, tracking_details.tracking_details, tracking_details.checkpoint_date, buyer_details.order_number, tracking_items.buyer_id')
            ->join('tracking_details', 'tracking_details.shipment_id = tracking_shipments.id', 'left')
            ->join('tracking_items', 'tracking_items.shipment_id = tracking_shipments.id', 'left')
            ->join('buyer_details', 'buyer_details.id = tracking_items.buyer_id')
            ->join('buyers', 'buyers.id = buyer_details.buyer')
            ->join('purchase_items', 'purchase_items.id = buyer_details.purchase_id')
            ->join('lead_lists', 'lead_lists.id = purchase_items.lead_id')
            ->join('files', 'files.id = lead_lists.file_id')
            ->where('files.activation', 'actived')
            ->where('files.oauth_uid', session()->get('oauth_uid'))
            ->where('tracking_shipments.created_at >=', $start . ' 00:00:00')
            ->where('tracking_shipments.created_at <=', $end . ' 23:59:59')
            ->groupBy('tracking_shipments.id')
            ->orderBy('tracking_shipments.id', 'DESC')
            ->get();