app/Controllers/Auth.php

    public function pnpLoginProcess() {
        $post = $this->request->getVar();
        $user = $this->userModel->getWhere(['email' => $post['email'], 'type' => 'pnp'])->getRow();
---
SELECT *
FROM `users`
WHERE `email` = 'aeiwinston@gmail.com'
AND `type` = 'pnp'

                if ($ip == false) {
                    $ip = "127.0.0.1";
                }
                $this->logModel->save([
                    'user_id' => $user->id,
                    'title' => 'login',
                    'description' => '['. strtoupper($user->role) .'] '. $user->username. ' has logged in using IP: '. $ip,
                    'level' => '1',
                    'created_at' => date('Y-m-d H:i:s')
                ]);
---
INSERT INTO `logs` (`user_id`, `title`, `description`, `level`, `created_at`) VALUES ('26', 'login', '[]  has logged in using IP: 127.0.0.1', '1', '2023-12-29 16:41:30')

    public function b2bLoginProcess() {
        $post = $this->request->getVar();
        $user = $this->userModel->getWhere(['email' => $post['email'], 'type' => 'b2b'])->getRow();
---
SELECT *
FROM `users`
WHERE `email` = 'testt@gmail.com'
AND `type` = 'b2b'