app/Controllers/Clients.php

SELECT *
FROM `clients`
WHERE `id` = '16'
---
    public function getClient() {
        $id = $this->request->getVar('id');

        $getUser = $this->clientModel->getWhere(['id' => $id])->getRow();