app/Controllers/Home.php

    public function inventories() {
        $userRole = session()->get('user_id');
        if (empty($userRole)) {
            header("Location: ".base_url('/login'));
            die();
        }

        $purchases = $this->assignModel->getAssignedData2();
        $buyers = $this->buyerStaffModel
            ->join('buyer_details', 'buyer_details.buyer = buyers.id')
            ->get();
---
SELECT *
FROM `buyers`
JOIN `buyer_details` ON `buyer_details`.`buyer` = `buyers`.`id`


            array_push($lists, $item);
        }
        $clientIDs = $this->clientModel->get();
        $clientList = $this->clientModel
            ->where('check_flag', 'checked')
            ->get();
---
SELECT *
FROM `clients`
SELECT *
FROM `clients`
WHERE `check_flag` = 'checked'