app/Controllers/Home.php

    public function invoices() {

        $invoices = $this->invoiceModel->getInvoicesData();
        $users = $this->userModel
            ->where('role', '')
            ->orderBy('id', 'DESC')->get();
---
SELECT *
FROM `users`
WHERE `role` = ''
ORDER BY `id` DESC