app/Controllers/Order.php

UPDATE `buyers` SET `cc` = '4576'
WHERE `id` = '1'
---
            $buyer1 = $post['buyer1'];
            //save cc numb
            if (!is_null($post['cc1'])) {
                $this->buyerStaffModel
                ->set('cc', $post['cc1'])
                ->where('id', $post['buyer1'])
                ->update();

SELECT *
FROM `files`
ORDER BY `created_at` DESC
SELECT *
FROM `staffs`
SELECT *
FROM `buyers`
WHERE `user_id` = '26'
---
    public function openFile() {
        $userRole = session()->get('role');
        $date = $this->request->getVar('date');
        $historyUpload = $this->fileModel->orderBy('created_at', 'DESC')->get();
        if ($date == null) {
            $date = date('Y-m-d');
            // $selections = $this->leadModel->getPruchaseData($date);

        } else {
            $temp = explode('-', $date);
            $date = $temp[2].'-'.$temp[0].'-'.$temp[1];

            // $selections = $this->leadModel->getPruchaseData($date);
        }

        $purchases = $this->orderModel->getPurchaseData($date);
        $staffs = $this->staffModel->get();
        $buyers = $this->buyerStaffModel->where('user_id', session()->get('user_id'))->get();