app/Models/InvoiceModel.php

SELECT `invoices`.*, `users`.`name`, `users`.`email`
FROM `invoices`
JOIN `inv_prep` ON `inv_prep`.`id` = `invoices`.`prep_id`
JOIN `inv_wholesale` ON `inv_wholesale`.`id` = `invoices`.`wholesale_id`
JOIN `inv_storage` ON `inv_storage`.`id` = `invoices`.`storage_id`
JOIN `inv_returns` ON `inv_returns`.`id` = `invoices`.`return_inv_id`
JOIN `inv_additional` ON `inv_additional`.`id` = `invoices`.`additional_id`
JOIN `users` ON `users`.`id` = `invoices`.`client`
ORDER BY `invoices`.`id` DESC
---
    public function getInvoicesData() {
        $query = $this->db->table('invoices')
            ->select('invoices.*, users.name, users.email')
            ->join('inv_prep', 'inv_prep.id = invoices.prep_id')
            ->join('inv_wholesale', 'inv_wholesale.id = invoices.wholesale_id')
            ->join('inv_storage', 'inv_storage.id = invoices.storage_id')
            ->join('inv_returns', 'inv_returns.id = invoices.return_inv_id')
            ->join('inv_additional', 'inv_additional.id = invoices.additional_id')
            ->join('users', 'users.id = invoices.client')
            ->orderBy('invoices.id', 'DESC')
            ->get();