app/Models/LogModel.php

SELECT *
FROM `logs`
ORDER BY `created_at` DESC
---
    public function getLogData($level = null) {
        if ($level == 1) {
            $query = $this->db->table('logs')
                ->orderBy('created_at', 'DESC')
                ->get();