app/Models/OrderModel.php

    public function getRestQty($id) {
        $query = $this->db->table('lead_lists')
            ->select('purchase_items.qty, SUM(buyer_details.buyer_qty) as buyer_qty')
            ->join('purchase_items', 'purchase_items.lead_id = lead_lists.id')
            ->join('buyer_details', 'buyer_details.purchase_id = purchase_items.id', 'left')
            ->where('purchase_items.id', $id)
            ->where('purchase_items.order_staff', session()->get('user_id'))
            ->groupBy('purchase_items.id')
            ->orderBy('purchase_items.id', 'DESC')
            ->get();
---
SELECT `purchase_items`.`qty`, SUM(buyer_details.buyer_qty) as buyer_qty
FROM `lead_lists`
JOIN `purchase_items` ON `purchase_items`.`lead_id` = `lead_lists`.`id`
LEFT JOIN `buyer_details` ON `buyer_details`.`purchase_id` = `purchase_items`.`id`
WHERE `purchase_items`.`id` = '15'
AND `purchase_items`.`order_staff` = '26'
GROUP BY `purchase_items`.`id`
ORDER BY `purchase_items`.`id` DESC